from aiogram import Router, types, F
from aiogram.filters import Command
import html

router = Router()

@router.message(Command("menu"))
@router.message(F.text == "Список команд")
async def cmd_help(message: types.Message):

    menu_text = (
        "<b>ДОСТУПНЫЕ КОМАНДЫ:</b>\n\n"
        "<b>Основные:</b>\n"
        "/start - запустить чат-бота заново\n"
        "/games - включить меню выбора игры\n"
        "/balance - показать баланс рофлов\n"
        "/my_farm - открыть меню майнинг-фермы\n"
        "/my_stats - посмотреть свою статистику\n"
        "/referral_link - твоя реферальная ссылка\n"
        "..................................................\n"
        "<b>Взаимодействие с другими игроками:</b>\n"
        "/send_coins - перевод монет другому игроку\n"
        "/make_team - создать команду (до 50 игроков)\n"
        "/make_clan - создать клан (до 1000 игроков)\n"
        "..................................................\n"
        "<b>Магазин:</b>\n"        
        "/trade - биржа (купить / продать монеты)\n"
        "/shop - общий магазин ROFL HUB\n"
        "..................................................\n"
        "<b>Все проекты:</b>\n"
        "/rofl_hub_all - каналы и сайты ROFL HUB, а также проекты друзей и партнёров\n"
        "..................................................\n"
        "<b>Поддержка:</b>\n"
        "/faq - частые вопросы\n"
        "/menu - показать общее меню бота (это сообщение)\n"
        "/rules - правила использования, отказ от ответственности\n"
        "/support - обращение админу (жалоба на игрока, проблемы с сервисом)\n"
    )

    await message.answer(menu_text, parse_mode="HTML")
