from aiogram import Router, types, F
from aiogram.filters import Command
import html

router = Router()

@router.message(Command("rules"))
@router.message(F.text == "Правила использования. Отказ от ответственности.")
async def cmd_rules(message: types.Message):

    rules_text = (
        "<b>ПРАВИЛА ИСПОЛЬЗОВАНИЯ ПЛАТФОРМЫ ROFL HUB:</b>\n"
        
        "..................................................\n"
        "<b>1. Внутриигровая валюта \"рофлы\".</b>\n"
        "1.1. Игровая валюта \"рофлы\" является исключительно элементом геймификации сервисов ROFL HUB.\n"
        "1.2. Игровая валюта \"рофлы\" не является реальным средством платежа, не является электронными деньгами или криптовалютой.\n"
        "1.3. Игровая валюта \"рофлы\" не подлежит обмену на фиатные деньги, такие как: доллар, евро, рубль, сум "
        "или любую другую официальную валюту какого-либо государства, а также на реальные средства оплаты "
        "(криптовалюта или любые другие реальные платежные средства вне экосистемы сервисов ROFL HUB (чат-бот, канал, сайт).\n"
        
        "..................................................\n"
        "<b>2. Покупки внутри ROFL HUB</b>\n"
        "2.1. Все внутриигровые ценности: игровая валюта \"монеты\" или \"рофлы\", лицензии на игровых персонажей "
        "\"робот-майнер\" и \"кибер-бурильщик\", VIP-идентификаторы (красивые ID в экосистеме ROFL HUB), слоты \"холодильника\" "
        "и \"кибер-котлеты\" приобретаются пользователем добровольно и возврату / обмену не подлежат.\n"
        "2.2. Владелец ROFL HUB не осуществляет возврат денежных средств и / или платежного средства Telegram Stars.\n"
        "2.3. Все претензии по покупке Telegram Stars принимаются исключительно платформами "
        "Telegram, Apple App Store, Google Play в соответствии с их правилами.\n"
        
        "..................................................\n"
        "<b>3. Несоблюдение правил использования ROFL HUB:</b>\n"
        "3.1. Администрация ROFL HUB оставляет за собой право в любой момент без объяснения причин: \n"
        "- заблокировать аккаунт пользователя временно\n"
        "- заблокировать аккаунт пользователя навсегда\n"
        "- аннулировать баланс пользователя\n"
        "- изъять купленный VIP ID\n"
        "за следующие нарушения: оскорбление или враждебные высказывания в адрес администрации ROFL HUB, "
        "оскорбление или враждебные высказывания в адрес других игроков и пользователей ROFL HUB, мошенничество, "
        "использование сторонних скриптов, ботов или других средств автоматизации игр, а также при нарушении норм приличия, "
        "попытке опубликовать мошеннические / фишинговые / спам ссылки или материалы, оскорбительный контент, задевающий любых "
        "людей, как пользователей ROFL HUB так и остальных людей за пределами пространства ROFL HUB "
        "по национальной, гендерной или религиозной принадлежности."

        "..................................................\n"
        "<b>4. Доступ к сервису ROFL HUB.</b>\n"
        "4.1. Сервис предоставляется по принципу \"как есть\". Администрация не несёт ответственности за "
        "временные сбои в работе серверов, задержки сети Telegram, утерю игрового прогресса или незачисленные вовремя монеты, "
        "вызванные техническими неполадками на стороне хостинга или мессенджера.\n"
        
        "..................................................\n"
        "<b>5. Возраст пользователей.</b>\n"
        "5.1. Использование любых сервисов ROFL HUB несовершеннолетними лицами должно "
        "осуществляться под контролем или с согласия их родителей / законных представителей (опекунов).\n"
        "5.2. Ответственность за любые действия несовершеннолетних, включая любые приобретения внутри "
        "игрового пространтсва ROFL HUB, а также приобретение Telegram Stars, полностью "
        "возлагается на их родителей или законных представителей (опекунов).\n"
        
        "..................................................\n"
        "/faq - частые вопросы\n"
        "/menu - показать общее меню бота\n"
        "/rules - правила использования, отказ от ответственности (это сообщение)\n"
        "/support - обращение админу (жалоба на игрока, проблемы с сервисом)\n"
    )

    await message.answer(rules_text, parse_mode="HTML")