from aiogram import Router, types, F
from aiogram.filters import Command
import html

router = Router()

@router.message(Command("start"))
@router.message(F.text == "Первое привествие")
async def cmd_start(message: types.Message):

    start_text = ("👋 <b>Привет! Я — главный бот экосистемы ROFL HUB.</b>\n\n"
                "<b>Добро пожаловать в игровой и развлекательный хаб нового поколения!</b>\n\n"
                "<b>Здесь ты сможешь:</b>\n"
                "🎮 Сыграть более чем в 20 чат-бот-игр против друга или бота\n"
                "🛡️ Создать свой клан и побороться за топовое место в глобальном рейтинге\n"
                "🎰 Вместе со своей бандой сорвать куш в миллион монет\n"
                "🪙 Заработать внутренние игровые монеты экосистемы — «рофлы»\n"
                "📢 Купить публикацию на сайте, чтобы продвинуть себя или свой блог\n\n"
                "<b>Этот чат-бот умеет:</b>\n"
                "📊 Показывать список всех игр, каналов и сайтов экосистемы\n"
                "⚡ Начислять рофлы за достижения и активность\n"
                "🔄 Переводить рофлы другому пользователю сообщества\n"
                "✨ Продавать публикации на сайте и занимать VIP-места для персон\n"
                "🚀 Продавать рофлы, ускорители, звания и статусы\n"
                "🌟 И многое другое...\n\n"
                "🤖 <i>Жми кнопку ниже, и я расскажу обо всём подробнее...</i>"
                )

    keyboard = types.InlineKeyboardMarkup(inline_keyboard=[
        [types.InlineKeyboardButton(text="🛸 ПРОДОЛЖИТЬ", callback_data="intro_step_2")]
    ])
    await message.answer(start_text, reply_markup=keyboard, parse_mode="HTML")

@router.callback_query(F.data == "intro_step_2")
async def cmd_start_step_2(callback: types.CallbackQuery):
    bonus_text = (
        "🎁 <b>ДЕРЖИ СВОИ ПЕРВЫЕ НАГРАДЫ ЗА РЕГИСТРАЦИЮ!</b>\n"
        "..................................................\n\n"
        "💰 Тебе начислено: <b>1 000 Рофлов</b>\n"
        "🥩 Тебе начислено: <b>1 Кибер-Котлета</b>\n"
        "..................................................\n\n"
        "🎈 Это твой приветственный стартовый бонус за вступление в ROFL HUB.\n"
        "🔒 <i>Бонус выдаётся только один раз при первой регистрации...</i>\n\n"
        "Монеты можно потратить разными способами, они — основа экономики хаба. Береги их...\n\n"
        "🛑 <b>Но у тебя наверняка возник вопрос:</b> Что за котлета? Кого ей кормить?"
    )
    await callback.message.edit_text(bonus_text, parse_mode="HTML")
    await callback.answer()