from aiogram import Router, types, F
from aiogram.filters import Command
import html

router = Router()

@router.message(Command("start"))
@router.message(F.text == "Первое приветствие")

async def cmd_start(message: types.Message):
    start_text = ("👋 <b>Привет! Я — ROFL HUB BOT, главный бот игровой экосистемы ROFL HUB. </b>"
                "<b>Это развлекательный хаб нового поколения!</b>\n\n"
                "<b>Здесь ты можешь:</b>\n"
                "🎮 Сыграть более чем в 20 чат-бот-игр против друга или бота\n"
                "💸 Заработать «рофлы» - внутренние игровые монеты экосистемы\n"
                "⚙️ Запустить ферму и круглосуточно майнить валюту <b>ROFL HUB</b>\n"
                "🏆 Создать свой клан и залететь в ТОП международного рейтинга\n"
                "💰 Вместе со своей бандой сорвать куш в миллион монет\n"
                "💬 Купить публикацию на сайте, чтобы продвинуть себя или свой блог\n\n"
                "<b>Этот чат-бот умеет:</b>\n"
                "🎮 Показывать список всех игр, каналов и сайтов экосистемы\n"
                "⚡ Начислять рофлы в играх, за достижения и активность\n"
                "🔄 Переводить игровые монеты другому пользователю хаба\n"
                "💎 Продавать публикации на сайте и занимать <b>VIP-места</b> для персон и блогеров\n"
                "🚀 Продавать ускорители, звания, статусы и многое другое...\n\n"
                "<i>Жми кнопку \"ПРОДОЛЖИТЬ\", расскажу подробнее 👇👇👇</i>"
                )

    keyboard = types.InlineKeyboardMarkup(inline_keyboard=[
        [types.InlineKeyboardButton(text="🛸 ПРОДОЛЖИТЬ", callback_data="intro_step_2")]
    ])
    await message.answer(start_text, reply_markup=keyboard, parse_mode="HTML")

@router.callback_query(F.data == "intro_step_2")
async def cmd_start_step_2(callback: types.CallbackQuery):
    bonus_text = (
        "🎁 <b>ДЕРЖИ СВОИ ПЕРВЫЕ НАГРАДЫ ЗА РЕГИСТРАЦИЮ!</b>\n"
        "..................................................\n"
        "💸 Тебе начислено: <b>1000 рофлов</b>\n"
        "🥩 Тебе начислено: <b>1 кибер-котлета</b>\n"
        "..................................................\n"
        "Это твой стартовый бонус за вступление в клуб ROFL HUB.\n\n"
        "🔒 <i>Бонус выдаётся только один раз при первой регистрации.</i>\n\n"
        "Монеты можно потратить разными способами, они — основа экономики хаба. Береги их...\n\n"
        "⁉️ <b>Но у тебя наверняка возник вопрос:</b> Что за котлета? Кого ей кормить?"
    )

    keyboard = types.InlineKeyboardMarkup(inline_keyboard=[
        [types.InlineKeyboardButton(text="Что за кибер-котлета?🥩🤔", callback_data="intro_step_3")]
    ])
    await callback.message.edit_text(bonus_text, reply_markup=keyboard, parse_mode="HTML")
    await callback.answer()

@router.callback_query(F.data == "intro_step_3")
async def cmd_start_step_3(callback: types.CallbackQuery):
    miner_text = (
        "<b>СНАЧАЛА НУЖНО ПОНЯТЬ, ПОЧЕМУ ТАК ВАЖНЫ ИГРОВЫЕ МОНЕТЫ \"РОФЛЫ\"?</b>\n\n"
        "Рофлы - это основа всей торговли, состязаний и покупок в <b>ROFL HUB</b>. "
        "Это почти единственная игровая валюта в мире, которую можно добывать бесплатно!\n"
        "..................................................\n"
        "<b>Сделать это можно разными способами:</b>\n\n"
        "- Приглашать друзей по реферальной ссылке\n"
        "- Побеждать в играх против бота\n"
        "- Рубиться в дуэли с другими игроками\n"
        "- Участвовать в командных и клановых битвах\n"
        "- Получать бонус за ежедневный вход и задания\n"
        "- Завести бота для круглосуточной добычи монет (робот-майнер / кибер-бурильщик)\n"
        "..................................................\n"
        "<b>Если ты завёл робота - его нужно кормить каждый день. </b>"
        "<b>Вот как раз здесь и пригодится кибер-котлета - это топливо для автоматической добычи игровой валюты, "
        "которое выдаётся бесплатно! </b>\n\n"
        "Нужно лишь зайти и покормить робота раз в день:) "
        "Если не покормить вовремя - бот разряжается и добыча валюты останавливается.\n\n"
        "Важно! Раз в месяц бот требует ремонта, т.к. он работает круглосуточно... "
        "Думаю, ты разберёшься с этим самостоятельно:) Не будем отвлекаться. \n\n"
        "Хочу рассказать тебе об играх и дуэлях <b>ROFL HUB</b>, чтобы тебе было понятно, как здесь всё устроено.\n\n"
        "🛑 <b>Это будет последнее сообщение нашего знакомства. Дальше только в бой:)</b>"
    )
    keyboard = types.InlineKeyboardMarkup(inline_keyboard=[
        [types.InlineKeyboardButton(text="Да расскажи уже скорее и в БОЙ!", callback_data="intro_step_4")]
    ])
    await callback.message.edit_text(miner_text, reply_markup=keyboard, parse_mode="HTML")
    await callback.answer()

@router.callback_query(F.data == "intro_step_4")
async def cmd_start_step_3(callback: types.CallbackQuery):
    finish_text = (
        "<b>РАССКАЗЫВАЮ ОЧЕНЬ КРАТКО. ROFL HUB - это:</b>\n\n"
        "- 23 чат-бот-игры\n"
        "- Возможность создать команду (до 50 человек)\n"
        "- Возможность создать клан (до 1000 человек)\n"
        "- Командные и клановые битвы за огромные призы\n"
        "- Познавательно-развлекательный канал ROFL HUB CHANNEL\n"
        "- Сайт rofl-hub.com для общения и продвижения без регистрации\n"
        "- Тысячи других игроков по всему миру, среди которых могут быть твои новые друзья!\n"
        "..................................................\n"
        "<b>Как и обещал, это было финальное сообщение знакомства. Дальше только в бой! Ниже ты видишь несколько ссылок:</b>\n\n"
        "/start - начать диалог заново (если что-то было непонятно)\n"
        "/games - список всех игр клуба ROFL HUB\n"
        "/menu - здесь собраны все команды этого чат-бота\n"
        "/faq - почитать часто-задаваемые вопросы\n"
    )
    await callback.message.edit_text(finish_text, parse_mode="HTML")
    await callback.answer()